Repository: Drem-dot/smart-charger-app-flutter
Catalog: lib/l10n/app_*.arb
Languages: vi

# appName
source: Smart Charger
vi: Sạc Thông Minh

# navMap
source: Map
vi: Bản đồ

# navStationList
source: List
vi: Danh sách

# navAddStation
source: Add
vi: Thêm

# navSettings
source: Settings
vi: Cài đặt

# searchPlaceholder
source: Search for a place...
vi: Tìm kiếm địa điểm...

# directionsTooltip
source: Directions
vi: Tìm đường

# directionsTitle
source: Directions
vi: Tìm đường

# directionsButton
source: Directions
vi: Dẫn đường

# cannotOpenMaps
source: Could not open Google Maps.
vi: Không thể mở ứng dụng Google Maps.

# sheetStationName
source: Station Name
vi: Tên trạm

# sheetAddress
source: Address
vi: Địa chỉ

# sheetStatusLabel
source: Status
vi: Trạng thái

# sheetConnectorsLabel
source: Connectors
vi: Cổng sạc

# sheetOperatingHoursLabel
source: Operating Hours
vi: Giờ hoạt động

# sheetParkingDetailsLabel
source: Parking Details
vi: Chi tiết đỗ xe

# sheetReportProblemTooltip
source: Report an issue
vi: Báo cáo vấn đề

# sheetConnectorDetailsTitle
source: Connector Details:
vi: Chi tiết cổng sạc:

# sheetConnectorTotalTitle
source: Total Connectors:
vi: Số lượng cổng sạc:

# sheetConnectorInfo
source: {count} ports
vi: {count} cổng

# sheetConnectorPowerInfo
source: {count} x {power}kW ports
vi: {count} cổng {power}kW

# noInfo
source: Not available
vi: Chưa có thông tin

# addStationScreenTitle
source: Add New Station
vi: Thêm Trạm Sạc Mới

# addStationMapLocation
source: Location on Map *
vi: Vị trí trên bản đồ *

# addStationMapHint
source: Tap to place a pin or drag the pin for the exact location.
vi: Nhấn để đặt ghim hoặc kéo ghim để chọn vị trí chính xác.

# addStationNameLabel
source: Station Name *
vi: Tên trạm sạc *

# addStationNameValidator
source: Please enter a name
vi: Vui lòng nhập tên

# addStationAddressLabel
source: Address *
vi: Địa chỉ *

# addStationAddressHint
source: Start typing to search...
vi: Bắt đầu nhập để tìm kiếm...

# addStationAddressValidator
source: Please enter an address
vi: Vui lòng nhập địa chỉ

# addStationNoAddressFound
source: No places found.
vi: Không tìm thấy địa điểm nào.

# addStationConnectorType
source: Connector Types
vi: Loại cổng sạc

# addStationPower
source: Power (kW)
vi: Công suất (kW)

# addStationOperatingHoursHint
source: Operating hours (e.g., 24/7)
vi: Giờ hoạt động (ví dụ: 24/7)

# addStationPricingDetailsHint
source: Pricing details
vi: Chi tiết giá

# addStationNetworkOperatorHint
source: Network operator
vi: Nhà cung cấp mạng lưới

# addStationAdminInfo
source: Information for Admin
vi: Thông tin cho Quản trị viên

# addStationOwnerNameLabel
source: Owner Name *
vi: Tên chủ trạm *

# addStationOwnerNameValidator
source: Please enter owner's name
vi: Vui lòng nhập tên chủ trạm

# addStationOwnerPhoneLabel
source: Owner Phone Number *
vi: Số điện thoại chủ trạm *

# addStationOwnerPhoneValidator
source: Please enter phone number
vi: Vui lòng nhập số điện thoại

# addStationImages
source: Station Images (optional)
vi: Hình ảnh trạm sạc (tùy chọn)

# addStationSubmitButton
source: Submit
vi: Gửi thông tin

# addStationSuccessMessage
source: "{stationName}" has been added and is pending review.
vi: "{stationName}" đã được thêm và đang chờ duyệt.

# addStationMapPinValidator
source: Please select a location on the map.
vi: Vui lòng chọn một vị trí trên bản đồ.

# addStationMaxImages
source: You can only select up to 4 images.
vi: Bạn chỉ có thể chọn tối đa 4 ảnh.

# stationListPageTitle
source: Station List
vi: Danh sách trạm sạc

# stationListPageSearchHint
source: Search by location...
vi: Tìm kiếm theo địa điểm...

# stationListError
source: Error: {error}
vi: Lỗi: {error}

# stationListEmpty
source: No charging stations found.
vi: Không tìm thấy trạm sạc nào.

# settingsPageTitle
source: Settings & Info
vi: Cài đặt & Thông tin

# settingsPartnership
source: Partnership Introduction
vi: Giới thiệu hợp tác

# settingsUserGuide
source: User Guide
vi: Hướng dẫn sử dụng

# settingsOwnerGuide
source: Station Owner Guide
vi: Hướng dẫn chủ trạm sạc

# settingsShareApp
source: Share App
vi: Chia sẻ ứng dụng

# settingsShareAppMessage
source: This is a nationwide charging station search app with full data. Visit the link https://sacthongminh.com to look up stations or install the Smart Charging app
vi: Đây là app tìm kiếm trạm sạc toàn quốc, dữ liệu đầy đủ. Truy cập link https://sacthongminh.com để tra cứu trạm hoặc cài app Sạc Thông Minh

# ownerGuideTitle
source: List Your Charging Station on the Map
vi: Đưa Trạm Sạc Của Bạn Lên Bản Đồ

# ownerGuideIntro
source: Thank you for your interest in contributing to the Smart Charger network. Listing your charging station on our system is completely free and takes only a few minutes.
vi: Cảm ơn bạn đã quan tâm đến việc đóng góp cho mạng lưới Sạc Thông Minh. Việc đưa trạm sạc của bạn lên hệ thống của chúng tôi hoàn toàn miễn phí và chỉ mất vài phút.

# ownerGuideStep1Title
source: Step 1: Prepare Information
vi: Bước 1: Chuẩn bị thông tin

# ownerGuideStep1Content
source: To ensure a smooth station addition process, please have the following information ready: • Exact name of the charging station. • Detailed address. • Precise location on the map (you will select it by dropping a pin). • Number and type of connectors (e.g., CCS2, Type 2...). • Power output of each connector type (e.g., 60kW, 120kW...). • Operating hours (e.g., 24/7, 8 AM - 10 PM). • Pricing details or parking fees (if any).
vi: Để quá trình thêm trạm diễn ra thuận lợi, vui lòng chuẩn bị sẵn các thông tin sau: • Tên chính xác của trạm sạc. • Địa chỉ chi tiết. • Vị trí chính xác trên bản đồ (bạn sẽ chọn bằng cách thả ghim). • Số lượng và loại cổng sạc (ví dụ: CCS2, Type 2...). • Công suất của từng loại cổng (ví dụ: 60kW, 120kW...). • Giờ hoạt động (ví dụ: 24/7, 8h - 22h). • Chi tiết giá hoặc phí đỗ xe (nếu có).

# ownerGuideStep2Title
source: Step 2: Use the "Add Station" Feature
vi: Bước 2: Sử dụng tính năng "Thêm trạm"

# ownerGuideStep2Content
source: • From the main map screen, tap the "Add Station" button (plus icon). • A small map will appear; move and long-press to "drop a pin" at your station's exact location, then tap "Confirm." • Fill in all the prepared information from Step 1 into the form. • Double-check everything and tap "Submit."
vi: • Từ màn hình bản đồ chính, nhấn vào nút "Thêm trạm" (biểu tượng dấu cộng). • Một bản đồ nhỏ sẽ hiện ra, hãy di chuyển và nhấn giữ để "thả ghim" vào đúng vị trí trạm của bạn, sau đó nhấn "Xác nhận". • Điền tất cả thông tin đã chuẩn bị ở Bước 1 vào biểu mẫu. • Kiểm tra lại mọi thứ và nhấn "Gửi đi".

# ownerGuideStep3Title
source: Step 3: Await Approval
vi: Bước 3: Chờ duyệt

# ownerGuideStep3Content
source: • After you submit the information, our team will proceed with verification. • This process may take 1-3 business days. • Once approved, your charging station will officially appear on the map for thousands of EV users to see. Thank you for your contribution!
vi: • Sau khi bạn gửi thông tin, đội ngũ của chúng tôi sẽ tiến hành xác minh. • Quá trình này có thể mất từ 1-3 ngày làm việc. • Khi được duyệt, trạm sạc của bạn sẽ chính thức xuất hiện trên bản đồ để hàng ngàn người dùng xe điện có thể thấy. Cảm ơn sự đóng góp của bạn!

# reportSheetTitle
source: Report an Issue
vi: Báo cáo vấn đề

# reportSheetReasonLabel
source: Reason for reporting*
vi: Lý do báo cáo*

# reportSheetReasonValidator
source: Please select a reason
vi: Vui lòng chọn một lý do

# reportSheetDetailsLabel
source: Issue details (optional)
vi: Chi tiết vấn đề (tùy chọn)

# reportSheetDetailsHint
source: Describe more...
vi: Mô tả thêm...

# reportSheetPhoneLabel
source: Phone number (optional)
vi: Số điện thoại (tùy chọn)

# reportSheetSubmitButton
source: Send Report
vi: Gửi báo cáo

# reportReasonStationNotWorking
source: Station not working/No power
vi: Trạm không hoạt động/Mất điện

# reportReasonConnectorBroken
source: Connector broken/Not charging
vi: Cổng sạc bị hỏng/Không nhận sạc

# reportReasonInfoIncorrect
source: Information in app is incorrect
vi: Thông tin trên ứng dụng bị sai

# reportReasonLocationIncorrect
source: Location on map is incorrect
vi: Vị trí trên bản đồ không chính xác

# reportReasonPaymentIssue
source: Payment issue
vi: Vấn đề về thanh toán

# reportReasonOther
source: Other reason (please describe in details)
vi: Lý do khác (vui lòng mô tả chi tiết)

# reviewsTitle
source: Reviews & Comments
vi: Đánh giá & Bình luận

# reviewsImagesTitle
source: Images
vi: Hình ảnh

# reviewsYourReviewTitle
source: Your Review:
vi: Đánh giá của bạn:

# reviewsNewCommentHint
source: Write your comment...
vi: Viết bình luận của bạn...

# reviewsEditCommentHint
source: Edit your comment...
vi: Sửa bình luận của bạn...

# reviewsSubmitButton
source: Submit Review
vi: Gửi đánh giá

# reviewsUpdateButton
source: Update
vi: Cập nhật

# reviewsDeleteButton
source: Delete
vi: Xóa

# reviewsDeleteDialogTitle
source: Delete review?
vi: Xóa đánh giá?

# reviewsDeleteDialogContent
source: Are you sure you want to delete this review?
vi: Bạn có chắc chắn muốn xóa đánh giá này không?

# reviewsDialogCancel
source: Cancel
vi: Hủy

# reviewsDialogDelete
source: Delete
vi: Xóa

# reviewsRatingValidator
source: Please select a rating.
vi: Vui lòng chọn số sao.

# reviewsNoOtherReviews
source: No other reviews yet.
vi: Chưa có đánh giá nào khác.

# reviewsLoadError
source: Error loading reviews: {error}
vi: Lỗi tải đánh giá: {error}

# unknownError
source: An unknown error occurred
vi: Đã xảy ra lỗi không xác định

source: Your location
vi: Vị trí của bạn

source: Choose on map
vi: Chọn trên bản đồ

source: Choose start point
vi: Chọn điểm bắt đầu

source: Choose destination
vi: Chọn điểm kết thúc

# swapTooltip
source: Swap
vi: Đảo ngược

# reportSendSuccess
source: Thank you for your report!
vi: Cảm ơn bạn đã gửi báo cáo!

# userGuideWelcome
source: Welcome to Smart Charger!
vi: Chào mừng bạn đến với Sạc Thông Minh!

# userGuideIntro
source: The app helps you easily find and navigate to electric vehicle charging stations nationwide. Here is a guide to the main features:
vi: Ứng dụng giúp bạn dễ dàng tìm kiếm và di chuyển đến các trạm sạc xe điện trên toàn quốc. Dưới đây là hướng dẫn các tính năng chính:

# userGuideSection1Title
source: 1. Search and Explore
vi: 1. Tìm kiếm và Khám phá

# userGuideSection1Content
source: • Use the search bar at the top to quickly move the map to a specific address or city. • Pan and zoom the map to discover charging stations around you. Stations will be automatically loaded and displayed.
vi: • Sử dụng thanh tìm kiếm ở trên cùng để nhanh chóng di chuyển bản đồ đến một địa chỉ hoặc thành phố cụ thể. • Lướt và zoom bản đồ để khám phá các trạm sạc xung quanh bạn. Các trạm sẽ tự động được tải và hiển thị.

# userGuideSection2Title
source: 2. Find Routes and View Details
vi: 2. Tìm đường và Xem chi tiết

# userGuideSection2Content
source: • Tap the "Directions" button (arrow icon) next to the search bar to open the route planning interface. • Choose your start and end points by: using your current location, selecting on the map, or searching for an address. • After the route is drawn, tap the "Find Stations on Route" button to filter and display only the charging stations along your route.
vi: • Nhấn vào nút "Đường đi" (biểu tượng mũi tên) cạnh thanh tìm kiếm để mở giao diện tìm lộ trình. • Chọn điểm bắt đầu và kết thúc bằng cách: dùng vị trí hiện tại, chọn trên bản đồ, hoặc tìm kiếm địa chỉ. • Sau khi lộ trình được vẽ, nhấn nút "Tìm trạm trên đường" để lọc và chỉ hiển thị các trạm sạc dọc theo tuyến đi của bạn.

# userGuideSection3Title
source: 3. View Station Information
vi: 3. Xem Thông tin Trạm sạc

# userGuideSection3Content
source: • Tap a charging station icon on the map to open the detailed information panel. • The panel will display full details: address, number of connectors, power, operating hours, and pricing information.
vi: • Nhấn vào một biểu tượng trạm sạc trên bản đồ để mở bảng thông tin chi tiết. • Bảng thông tin sẽ hiển thị đầy đủ: địa chỉ, số lượng cổng sạc, công suất, giờ hoạt động, và chi tiết về giá.

# userGuideSection4Title
source: 4. Navigate to the Station
vi: 4. Dẫn đường đến Trạm

# userGuideSection4Content
source: • In the detailed information panel, tap the "Directions" button. The app will automatically open Google Maps to start navigating you.
vi: • Trong bảng thông tin chi tiết, nhấn nút "Dẫn đường". Ứng dụng sẽ tự động mở Google Maps để bắt đầu chỉ đường cho bạn.

# userGuideSection5Title
source: 5. Report an Issue
vi: 5. Báo cáo Vấn đề

# userGuideSection5Content
source: • If the station information is incorrect or you encounter a problem while charging, please tap "Report an Issue" in the detailed information panel to help us improve the data.
vi: • Nếu thông tin trạm sạc không chính xác hoặc gặp vấn đề khi sạc, hãy nhấn vào "Báo cáo vấn đề" trong bảng thông tin chi tiết để giúp chúng tôi cải thiện dữ liệu.
